Tekla.Structures.Dialog.UIControls.MeshCatalog
The MeshCatalog class represents a group of controls to select meshes
using the mesh catalogs.

Tekla.Structures.Dialog.UIControls.MeshCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.MeshCatalog.OnLoad(System.EventArgs)
When the load event is raised, the control begins to enumerate through the rebar
catalog.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.MeshCatalog.OnSelectClicked(System.Object,System.EventArgs)
Opens the profile catalog dialog for selecting a mesh
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.MeshCatalog.SelectedMeshName
The mesh name in the control.

Tekla.Structures.Dialog.UIControls.MeshCatalog.SelectedMeshGrade
The mesh grade in the control.

Tekla.Structures.Dialog.UIControls.MeshCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.MeshCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.MeshCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.MeshCatalog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.MeshCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.MeshCatalog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.